Repository: alexey-karasev/touch
Catalog: touch/resources/i18n/*.lproj/Localizable.strings
Languages: ru

# INVALID_EMAIL
source: Invalid email format
ru: Неверный формат email

# USERNAME_FIELD_REQUIRED
source: Username field is required. Please enter your email, phone or login
ru: Необходимо указать имя пользователя. Пожалуйста укажите email, номер телефона, или логин

source: Error
ru: Ошибка

source: Ok
ru: Ок

# PASSWORD_FIELD_REQUIRED
source: Password field is required
ru: Пожалуйста, введите пароль

# LOGIN_FIELD_REQUIRED
source: Login field is required
ru: Пожалуйста, укажите логин

# NAME_FIELD_REQUIRED
source: Name field is required
ru: Пожалуйста, укажите Ваше имя

# PHONE_FIELD_REQUIRED
source: Phone field is required
ru: Пожалуйста, укажите Ваш номер телефона

# VERIFICATION_FIELD_REQUIRED
source: Verification field is required
ru: Пожалуйста, укажите код подтверждения

source: Unknown connection error
ru: Неизвестная ошибка подключения

# US
source: UNITED STATES
ru: США

source: RUSSIA
ru: РОССИЯ

# UNEXPECTED_SERVER_RESPONSE
source: Unexpected server reponse
ru: Неверный ответ сервера

source: Unknown server error
ru: Неизвестная ошибка сервера

source: Unknown error
ru: Неизвестная ошибка

# INVALID_TOKEN
source: The server issued invalid token
ru: Сервер прислал неправильный токен

# CANNOT_NOT_CONNECT_TO_SERVER
source: Could not connect to server
ru: Не удалось подключиться к серверу

source: Request to server timed out
ru: Сервер не отвечает

# IPHONE_NOT_CONNECTED_TO_INTERNET
source: Iphone is not connected to internet
ru: Iphone не подключен к интернету

source: Unknown Web API Error
ru: Неизвестная ошибка Web API

# EMAIL_IS_NOT_UNIQUE
source: The user with this email already exists
ru: Пользователь с таким email уже зарегистрирован

# PHONE_IS_NOT_UNIQUE
source: The user with this phone already exists
ru: Пользователь с таким номером телефона уже зарегистрирован

# LOGIN_IS_NOT_UNIQUE
source: The user with this login already exists
ru: Пользователь с таким логином уже зарегистрирован

# EMAIL_IS_EMPTY
source: The email field is empty
ru: Поле Email должно быть заполнено

# PHONE_IS_EMPTY
source: The phone field is empty
ru: Поле Номер телефона должно быть заполнено

# LOGIN_IS_EMPTY
source: The login field is empty
ru: Поле Логин пользователя должно быть заполнено

source: Invalid confirmation code
ru: Неверный код подтверждения

source: Invalid username or password
ru: Неверное имя пользователя или пароль
